app/views/techandsols/_form.html.erb

SELECT "idea_statuses".* FROM "idea_statuses"
SELECT "imp_owners".* FROM "imp_owners"
---
    <%= f.label "Status:" %>
    <%= f.collection_select :Status_id, IdeaStatus.all, :id, :Status, include_blank: false %>
    <%= f.label "Imperative Owner:" %>
    <%= f.collection_select :ImpOwner_id, ImpOwner.all, :id, :ImperativeOwner, include_blank: false %>