app/views/techandsols/_form.html.erb

SELECT "imp_owners".* FROM "imp_owners" WHERE "imp_owners"."id" IN (8, 9, 10, 11, 12, 13, 14)
---
    <%= f.label "Imperative Owner:" %>
    <%= f.collection_select :ImpOwner_id, ImpOwner.find(8,9,10,11,12,13,14), :id, :ImperativeOwner, include_blank: false %>