app/views/procandecos/_form.html.erb

SELECT "idea_statuses".* FROM "idea_statuses"
SELECT "imp_owners".* FROM "imp_owners" WHERE "imp_owners"."id" IN (4, 5, 6, 7)
---
    <%= f.label "Status:" %>
    <%= f.collection_select :Status_id, IdeaStatus.all, :id, :Status, include_blank: false %>
    <%= f.label "Imperative Owner:" %>
    <%= f.collection_select :ImpOwner_id, ImpOwner.find(4,5,6,7), :id, :ImperativeOwner, include_blank: false %>