app/views/procandecos/_form.html.erb

    <%= f.label "Imperative Owner:" %>
    <%= f.collection_select :ImpOwner_id, ImpOwner.all, :id, :ImperativeOwner, include_blank: false %>
---
SELECT "imp_owners".* FROM "imp_owners"