app/views/knowandculs/_form.html.erb

    <%= f.label "Status:" %>
    <%= f.collection_select :Status_id, IdeaStatus.all, :id, :Status, include_blank: false %>
---
SELECT "idea_statuses".* FROM "idea_statuses"

    <%= f.label "Imperative Owner:" %>
    <%= f.collection_select :ImpOwner_id, ImpOwner.all, :id, :ImperativeOwner, include_blank: false %>
---
SELECT "imp_owners".* FROM "imp_owners"