app/views/knowandculs/_form.html.erb

SELECT "imp_owners".* FROM "imp_owners" WHERE "imp_owners"."id" IN (1, 2)
---
    <%= f.label "Imperative Owner:" %>
    <%= f.collection_select :ImpOwner_id, ImpOwner.find(1,2,3), :id, :ImperativeOwner, include_blank: false %>