app/controllers/knowandculs_controller.rb

  def index
    @knowandculs = Knowandcul.all
---
SELECT "knowandculs".* FROM "knowandculs"

  def create
    @knowandcul = Knowandcul.new(knowandcul_params)

    respond_to do |format|
      if @knowandcul.save
---
INSERT INTO "knowandculs" ("Name", "Summary", "Description", "Owner", "Reviewed", "Status_id", "Comments", "Action", "ImpOwner_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @knowandcul.update(knowandcul_params)
---
UPDATE "knowandculs" SET "Status_id" = ?, "updated_at" = ? WHERE "knowandculs"."id" = ?  [["Status_id", 5], ["updated_at", "2015-05-22 15:04:36.203857"], ["id", 1]]

  def destroy
    @knowandcul.destroy
---
DELETE FROM "knowandculs" WHERE "knowandculs"."id" = ?  [["id", 4]]

    def set_knowandcul
      @knowandcul = Knowandcul.find(params[:id])
---
SELECT  "knowandculs".* FROM "knowandculs" WHERE "knowandculs"."id" = ? LIMIT 1  [["id", 4]]