app/controllers/procandecos_controller.rb

SELECT "procandecos".* FROM "procandecos"
---
  def index
    @procandecos = Procandeco.all

INSERT INTO "procandecos" ("Name", "Summary", "Description", "Owner", "Reviewed", "Status_id", "Comments", "Action", "ImpOwner_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @procandeco = Procandeco.new(procandeco_params)

    respond_to do |format|
      if @procandeco.save

UPDATE "procandecos" SET "Description" = ?, "Comments" = ?, "updated_at" = ? WHERE "procandecos"."id" = ?
---
  def update
    respond_to do |format|
      if @procandeco.update(procandeco_params)

SELECT  "procandecos".* FROM "procandecos" WHERE "procandecos"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_procandeco
      @procandeco = Procandeco.find(params[:id])