app/controllers/techandsols_controller.rb

  def index
    @techandsols = Techandsol.all
---
SELECT "techandsols".* FROM "techandsols"

  def create
    @techandsol = Techandsol.new(techandsol_params)

    respond_to do |format|
      if @techandsol.save
---
INSERT INTO "techandsols" ("Name", "Summary", "Description", "Owner", "Reviewed", "Status_id", "Comments", "Action", "ImpOwner_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @techandsol.update(techandsol_params)
---
UPDATE "techandsols" SET "ImpOwner_id" = ?, "updated_at" = ? WHERE "techandsols"."id" = ?  [["ImpOwner_id", 2], ["updated_at", "2015-05-09 05:12:56.397269"], ["id", 2]]

    def set_techandsol
      @techandsol = Techandsol.find(params[:id])
---
SELECT  "techandsols".* FROM "techandsols" WHERE "techandsols"."id" = ? LIMIT 1  [["id", 2]]