app/controllers/welcome_controller.rb

SELECT "procandecos".* FROM "procandecos"
SELECT "knowandculs".* FROM "knowandculs"
SELECT "techandsols".* FROM "techandsols"
SELECT COUNT(*) FROM "procandecos"
SELECT COUNT(*) FROM "knowandculs"
SELECT COUNT(*) FROM "techandsols"
---
  def index

    # get the ideas count
    @procandecos = Procandeco.all
    @knowandculs = Knowandcul.all
    @techandsols = Techandsol.all

    @ProcIdeas  = @procandecos.count
    @KnowIdeas  = @knowandculs.count
    @TechIdeas  = @techandsols.count